<?php

/**____________________________________________________________________________________________________________________________
 * Код пишется в header.php. Пишется для того, чтобы на главной странице тег body был пустой, а на всех остальных страницах
 * в тег body добавлялся класс inner. Функция is_front_page(); дает true если мы на главной странице. Но нам нужен обратный
 * эффект.
 * 
 */

?>
<?php $body_class = '';
if (!is_front_page()) {
    $body_class = 'inner';
} ?>

<body class="<?php echo $body_class; ?>"></body>

<?php /**^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^ */ ?>


<?php /**__________________________________________________________________________________________________________________________
 * Код, который убирает админбар. Пишется в функциях в любом мете.*/ ?>
<?php add_filter('show_admin_bar', '__return_false'); ?>
<?php /**^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^ */ ?>


<?php /**
 * Выводим меню через цикл */ ?>

<?php

$locations = get_nav_menu_locations();
$menu_id = $locations['menu_footer']; // Где menu_footer это id локации, получено c помощью var_dump();
$menu_items  = wp_get_nav_menu_items(
    $menu_id,
    [
        'order' => 'ASC',
        'orderby' => 'menu_order',
    ]
); ?>

<nav class="main-navigation">
    <ul class="main-navigation__list">
        <?php
        foreach ($menu_items as $item) : ?>

            <li>
                <a href="<?php echo $item->url ?>"><?php echo $item->title; ?></a>
            </li>

        <?php endforeach; ?>
    </ul>
</nav>
<?php /*^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^ */ ?>

<?php /**__________________________________________________________________________________________________________________________________
 * Функция которая возвращает дату в виде "Этот пост был написана 2 недели назад." */ ?>

<?php function return_data_last_public_post()
{
    return sprintf(esc_html__('%s ago', 'textdomain'), human_time_diff(get_the_time('U'), current_time('timestamp')));
}
add_filter('the_time', 'return_data_last_public_post'); ?>
<?php /**^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^ */ ?>





<?php /**_____________________________________________________________________________________________________________________________________________ ?>
<?php * Функции которые возвращают классический вид sidebar */ ?>

<?php

//Возвращает классический вид sidebars
add_filter('gutenberg_use_widgets_block_editor', '__return_false');
add_filter('use_widgets_block_editor', '__return_false');

?>
<?php /**^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^ */ ?>




<?php
/**___________________________________________________________________________________________________________
 * Функция с помощью которой можно получить одну любую запись.
 */
?>
<?php

//Получаем в переменную объект. 21-id поста.
// и выводим изначально заглавие поста,
// содержание поста и данные с acf поля с названием 'price'.
// Так же выводим картинку с acf. Название поля photo.
//
$post = get_post(21);
?>

<!-- Заголовок поста -->
<h1><?php echo $post->post_title; ?></h1>

<!-- Вывод содержимого поста. Первый параметр 'the_content'-->
<?php echo apply_filters('the_content', $post->post_content); ?>

<!-- Вывод acf поля с помощью функции get_post_meta -->
<p>
    <?php echo get_post_meta($post->ID, 'price', true) ?>
</p>

<!-- Вместо get_post_meta можно использовать get_field() или get_fields(). Варианты ниже -->
<?php echo get_field('price', $post->ID); ?>
<?php echo get_fields($post_ID)['price'] ?>

<!-- Вывод картинки с acf поля  -->
<?php $image = get_post_meta($post->ID, 'photo', true); ?>
<?php echo wp_get_attachment_image ( $image, 'full', false, array()) ?>

<?php /**
 * ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
 * 
 */
 ?>




